# Brewfile for macOS dotfiles setup

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Core tools
brew "stow"              # Symlink manager
brew "git"               # Version control
brew "tmux"              # Terminal multiplexer
brew "neovim"            # Text editor
brew "zsh"               # Shell

# CLI utilities
brew "ripgrep"           # Fast text search (rg)
brew "fd"                # Fast file search
brew "bat"               # Better cat with syntax highlighting
brew "fzf"               # Fuzzy finder
brew "eza"               # Modern ls replacement
brew "zoxide"            # Smarter cd command
brew "starship"          # Cross-shell prompt (alternative to p10k)
brew "jq"                # JSON processor
brew "tree"              # Directory tree viewer
brew "wget"              # File downloader
brew "curl"              # Data transfer tool
brew "htop"              # Process viewer
brew "ncdu"              # Disk usage analyzer

# Development tools
brew "python@3.12"       # Python
brew "node"              # Node.js
brew "go"                # Go programming language
brew "rust"              # Rust programming language
brew "cmake"             # Build tool
brew "make"              # Build tool

# Version managers
brew "asdf"              # Version manager for multiple languages

# Git tools
brew "gh"                # GitHub CLI
brew "git-delta"         # Better git diffs
brew "lazygit"           # Terminal UI for git

# Optional but useful
brew "tldr"              # Simplified man pages
brew "direnv"            # Directory-specific environment variables

# Casks (GUI applications)
cask "wezterm"           # GPU-accelerated terminal emulator

# Fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"